#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # civo_instance.github-action will be created
  + resource "civo_instance" "github-action" {
      + created_at       = (known after apply)
      + hostname         = "github-action.com"
      + id               = (known after apply)
      + initial_password = (known after apply)
      + notes            = "this is a note for the server"
      + private_ip       = (known after apply)
      + pseudo_ip        = (known after apply)
      + public_ip        = (known after apply)
      + status           = (known after apply)
      + tags             = [
          + "nginx",
          + "python",
        ]
    }

  # civo_network.custom_net will be created
  + resource "civo_network" "custom_net" {
      + cidr    = (known after apply)
      + default = (known after apply)
      + id      = (known after apply)
      + label   = "test_network"
      + name    = (known after apply)
      + region  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @alejandrojnm, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-deploy`*